
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       2 |          1 |           2 |
## Affected resources by action

|  Action  | Resources                                                                |
|:--------:|:-------------------------------------------------------------------------|
|    🟢     | `module.repos["demo-repo"].github_repository.repo`                       |
|    🟢     | `module.repos["demo-repo"].github_team_repository.dev`                   |
|    🟢     | `github_membership.infrahouse["akuzminsky"]:`                            |
|    🟡     | `module.repos["infrahouse-toolkit"].github_repository.repo`              |
|    🔴     | `module.repos["cookiecutter-github-control"].github_repository.repo`     |
|    🔴     | `module.repos["cookiecutter-github-control"].github_team_repository.dev` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/fe8f8905-28f5-44e2-8a51-0c7dc1136d59/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_team.dev: Refreshing state... [id=7332815]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Template for a GitHub Control repository" -> null
      - etag                        = "W/\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\"" -> null
      - full_name                   = "infrahouse/cookiecutter-github-control" -> null
      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - id                          = "cookiecutter-github-control" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "cookiecutter-github-control" -> null
      - node_id                     = "R_kgDOI528zg" -> null
      - private                     = false -> null
      - repo_id                     = 597540046 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null
      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\"" -> null
      - id         = "7332815:cookiecutter-github-control" -> null
      - permission = "push" -> null
      - repository = "cookiecutter-github-control" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["demo-repo"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "This is a demo repo"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "demo-repo"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos["demo-repo"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "demo-repo"
      + team_id    = "7332815"
    }

  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description                 = "InfraHouse Toolkit" -> "(UPDATE): InfraHouse Toolkit"
        id                          = "infrahouse-toolkit"
        name                        = "infrahouse-toolkit"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed%0A  # (because module.repos["cookiecutter-github-control"] is not in configuration)%0A  - resource "github_repository" "repo" {%0A      - allow_auto_merge            = false -> null%0A      - allow_merge_commit          = true -> null%0A      - allow_rebase_merge          = true -> null%0A      - allow_squash_merge          = true -> null%0A      - allow_update_branch         = false -> null%0A      - archived                    = false -> null%0A      - default_branch              = "main" -> null%0A      - delete_branch_on_merge      = false -> null%0A      - description                 = "Template for a GitHub Control repository" -> null%0A      - etag                        = "W/\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\"" -> null%0A      - full_name                   = "infrahouse/cookiecutter-github-control" -> null%0A      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null%0A      - has_discussions             = false -> null%0A      - has_downloads               = false -> null%0A      - has_issues                  = true -> null%0A      - has_projects                = false -> null%0A      - has_wiki                    = false -> null%0A      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null%0A      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null%0A      - id                          = "cookiecutter-github-control" -> null%0A      - is_template                 = false -> null%0A      - merge_commit_message        = "PR_TITLE" -> null%0A      - merge_commit_title          = "MERGE_MESSAGE" -> null%0A      - name                        = "cookiecutter-github-control" -> null%0A      - node_id                     = "R_kgDOI528zg" -> null%0A      - private                     = false -> null%0A      - repo_id                     = 597540046 -> null%0A      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null%0A      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null%0A      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null%0A      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null%0A      - topics                      = [] -> null%0A      - visibility                  = "public" -> null%0A      - vulnerability_alerts        = false -> null%0A%0A      - security_and_analysis {%0A%0A          - secret_scanning {%0A              - status = "disabled" -> null%0A            }%0A%0A          - secret_scanning_push_protection {%0A              - status = "disabled" -> null%0A            }%0A        }%0A    }%0A%0A  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed%0A  # (because module.repos["cookiecutter-github-control"] is not in configuration)%0A  - resource "github_team_repository" "dev" {%0A      - etag       = "W/\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\"" -> null%0A      - id         = "7332815:cookiecutter-github-control" -> null%0A      - permission = "push" -> null%0A      - repository = "cookiecutter-github-control" -> null%0A      - team_id    = "7332815" -> null%0A    }%0A%0A  # module.repos["demo-repo"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "This is a demo repo"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "demo-repo"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = "public"%0A%0A      + security_and_analysis {%0A          + advanced_security {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning_push_protection {%0A              + status = (known after apply)%0A            }%0A        }%0A    }%0A%0A  # module.repos["demo-repo"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "demo-repo"%0A      + team_id    = "7332815"%0A    }%0A%0A  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place%0A  ~ resource "github_repository" "repo" {%0A      ~ description                 = "InfraHouse Toolkit" -> "(UPDATE): InfraHouse Toolkit"%0A        id                          = "infrahouse-toolkit"%0A        name                        = "infrahouse-toolkit"%0A        # (31 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvZmU4Zjg5MDUtMjhmNS00NGUyLThhNTEtMGM3ZGMxMTM2ZDU5L3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVBdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnB5cGlfYXBpX3Rva2VuW1wiaW5mcmFob3VzZS10b29sa2l0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dXHUwMDFiWzBtXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgXHUwMDFiWzMybStcdTAwMWJbMG0gY3JlYXRlXG4gIFx1MDAxYlszM21+XHUwMDFiWzBtIHVwZGF0ZSBpbi1wbGFjZVxuICBcdTAwMWJbMzFtLVx1MDAxYlswbSBkZXN0cm95XG5cdTAwMWJbMG1cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSBcdTAwMWJbMW1cdTAwMWJbMzFtZGVzdHJveWVkXHUwMDFiWzBtXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVx1MDAxYlswbVxuXHUwMDFiWzBtICBcdTAwMWJbMzFtLVx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfYXV0b19tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgID0gZmFsc2UgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19tZXJnZV9jb21taXRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfcmViYXNlX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3NxdWFzaF9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd191cGRhdGVfYnJhbmNoXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gXCJtYWluXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWxldGVfYnJhbmNoX29uX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlc2NyaXB0aW9uXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICA9IFwiVGVtcGxhdGUgZm9yIGEgR2l0SHViIENvbnRyb2wgcmVwb3NpdG9yeVwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZXRhZ1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJXL1xcXCI4YjRhNzkyYmMxNDc0ZDM4MWNhYWE2M2I3NjY2ODk5M2I0YWRjNDJhZTc2ZWQ1M2Q2ODg2ZDg1NjJlYmIwYzY3XFxcIlwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZ2l0X2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gXCJnaXQ6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaGFzX2Rpc2N1c3Npb25zXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgID0gZmFsc2UgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZG93bmxvYWRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWUgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfcHJvamVjdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc193aWtpXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlzX3RlbXBsYXRlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbm9kZV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gXCJSX2tnRE9JNTI4emdcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXByaXZhdGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb19pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gNTk3NTQwMDQ2IFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJDT01NSVRfTUVTU0FHRVNcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zc2hfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBcImdpdEBnaXRodWIuY29tOmluZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3ZuX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXRvcGljc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICA9IFtdIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZ1bG5lcmFiaWxpdHlfYWxlcnRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMge1xuXG4gICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJkaXNhYmxlZFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IFwiZGlzYWJsZWRcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlx1MDAxYlswbSB3aWxsIGJlIFx1MDAxYlsxbVx1MDAxYlszMW1kZXN0cm95ZWRcdTAwMWJbMG1cbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszMW0tXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZXRhZ1x1MDAxYlswbVx1MDAxYlswbSAgICAgICA9IFwiVy9cXFwiODA0M2Y4MWIxOTY5M2Y2YzFhNzJkMjFiYjhkYzAzODU5Yzk4YmY3OGJmYmU3OTc4MmJmZTEzZmE4MTM5OTJjYVxcXCJcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBcIjczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wZXJtaXNzaW9uXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJwdXNoXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXRlYW1faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgPSBcIjczMzI4MTVcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUucmVwb3NbXCJkZW1vLXJlcG9cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X2F1dG9fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19tZXJnZV9jb21taXRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19yZWJhc2VfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19zcXVhc2hfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hcmNoaXZlZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVsZXRlX2JyYW5jaF9vbl9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlc2NyaXB0aW9uXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICA9IFwiVGhpcyBpcyBhIGRlbW8gcmVwb1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1mdWxsX25hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1naXRfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfaXNzdWVzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1odG1sX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1odHRwX2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1tZXJnZV9jb21taXRfbWVzc2FnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW1lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImRlbW8tcmVwb1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wcml2YXRlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zc2hfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG12aXNpYmlsaXR5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXNlY3VyaXR5X2FuZF9hbmFseXNpcyB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtYWR2YW5jZWRfc2VjdXJpdHkge1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiZGVtby1yZXBvXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2XHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWV0YWdcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcGVybWlzc2lvblx1MDAxYlswbVx1MDAxYlswbSA9IFwicHVzaFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtID0gXCJkZW1vLXJlcG9cIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdGVhbV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICA9IFwiNzMzMjgxNVwiXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZXNjcmlwdGlvblx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgVG9vbGtpdFwiIFx1MDAxYlszM20tPlx1MDAxYlswbSBcdTAwMWJbMG1cIihVUERBVEUpOiBJbmZyYUhvdXNlIFRvb2xraXRcIlxuICAgICAgICBcdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtdG9vbGtpdFwiXG4gICAgICAgIFx1MDAxYlsxbVx1MDAxYlswbW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0XCJcbiAgICAgICAgXHUwMDFiWzkwbSMgKDMxIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG1cblxuICAgICAgICBcdTAwMWJbOTBtIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuICAgIH1cblxuXHUwMDFiWzBtXHUwMDFiWzFtUGxhbjpcdTAwMWJbMG0gMiB0byBhZGQsIDEgdG8gY2hhbmdlLCAyIHRvIGRlc3Ryb3kuXG5cdTAwMWJbMG1cdTAwMWJbOTBtXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG1cblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGUlMEEgIFx1MDAxYlszM21+XHUwMDFiWzBtIHVwZGF0ZSBpbi1wbGFjZSUwQSAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gZGVzdHJveSUwQVx1MDAxYlswbSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIFx1MDAxYlsxbVx1MDAxYlszMW1kZXN0cm95ZWRcdTAwMWJbMG0lMEEgICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMxbS1cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19hdXRvX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19tZXJnZV9jb21taXRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3JlYmFzZV9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfc3F1YXNoX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd191cGRhdGVfYnJhbmNoXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hcmNoaXZlZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWZhdWx0X2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgPSBcIm1haW5cIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWxldGVfYnJhbmNoX29uX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZXNjcmlwdGlvblx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgPSBcIlRlbXBsYXRlIGZvciBhIEdpdEh1YiBDb250cm9sIHJlcG9zaXRvcnlcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlcvXFxcIjhiNGE3OTJiYzE0NzRkMzgxY2FhYTYzYjc2NjY4OTkzYjRhZGM0MmFlNzZlZDUzZDY4ODZkODU2MmViYjBjNjdcXFwiXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWdpdF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IFwiZ2l0Oi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZGlzY3Vzc2lvbnNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZG93bmxvYWRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfaXNzdWVzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSB0cnVlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19wcm9qZWN0c1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc193aWtpXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0bWxfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHR0cF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2wuZ2l0XCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pc190ZW1wbGF0ZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1tZXJnZV9jb21taXRfbWVzc2FnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgPSBcIlBSX1RJVExFXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSBcIlJfa2dET0k1Mjh6Z1wiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXByaXZhdGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IDU5NzU0MDA0NiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3NoX2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gXCJnaXRAZ2l0aHViLmNvbTppbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXRvcGljc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICA9IFtdIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZpc2liaWxpdHlcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IFwicHVibGljXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdnVsbmVyYWJpbGl0eV9hbGVydHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gZmFsc2UgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtc2VjdXJpdHlfYW5kX2FuYWx5c2lzIHslMEElMEEgICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nIHslMEEgICAgICAgICAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IFwiZGlzYWJsZWRcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICAgICAgICB9JTBBJTBBICAgICAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbXNlY3JldF9zY2FubmluZ19wdXNoX3Byb3RlY3Rpb24geyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJkaXNhYmxlZFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgICAgICAgIH0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXZcdTAwMWJbMG0gd2lsbCBiZSBcdTAwMWJbMW1cdTAwMWJbMzFtZGVzdHJveWVkXHUwMDFiWzBtJTBBICAjIChiZWNhdXNlIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcdTAwMWJbMG0lMEFcdTAwMWJbMG0gIFx1MDAxYlszMW0tXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIgeyUwQSAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWV0YWdcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgPSBcIlcvXFxcIjgwNDNmODFiMTk2OTNmNmMxYTcyZDIxYmI4ZGMwMzg1OWM5OGJmNzhiZmJlNzk3ODJiZmUxM2ZhODEzOTkyY2FcXFwiXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICA9IFwiNzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wZXJtaXNzaW9uXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJwdXNoXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeVx1MDAxYlswbVx1MDAxYlswbSA9IFwiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdGVhbV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICA9IFwiNzMzMjgxNVwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcImRlbW8tcmVwb1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19hdXRvX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X21lcmdlX2NvbW1pdFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19yZWJhc2VfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfc3F1YXNoX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlbGV0ZV9icmFuY2hfb25fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVzY3JpcHRpb25cdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gXCJUaGlzIGlzIGEgZGVtbyByZXBvXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWdpdF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfaXNzdWVzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImRlbW8tcmVwb1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbm9kZV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXByaXZhdGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJDT01NSVRfTUVTU0FHRVNcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zc2hfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3ZuX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZpc2liaWxpdHlcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IFwicHVibGljXCIlMEElMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMgeyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1hZHZhbmNlZF9zZWN1cml0eSB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmcgeyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgIH0lMEElMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcImRlbW8tcmVwb1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWV0YWdcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wZXJtaXNzaW9uXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJwdXNoXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtID0gXCJkZW1vLXJlcG9cIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXRlYW1faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgPSBcIjczMzI4MTVcIiUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZXNjcmlwdGlvblx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgVG9vbGtpdFwiIFx1MDAxYlszM20tPlx1MDAxYlswbSBcdTAwMWJbMG1cIihVUERBVEUpOiBJbmZyYUhvdXNlIFRvb2xraXRcIiUwQSAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXRvb2xraXRcIiUwQSAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXRvb2xraXRcIiUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDMxIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEElMEEgICAgICAgIFx1MDAxYls5MG0jICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgIH0lMEElMEFcdTAwMWJbMG1cdTAwMWJbMW1QbGFuOlx1MDAxYlswbSAyIHRvIGFkZCwgMSB0byBjaGFuZ2UsIDIgdG8gZGVzdHJveS4lMEFcdTAwMWJbMG1cdTAwMWJbOTBtJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDIsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDJ9fQ==```
</p></details>